import { convertIcon } from '@douyinfe/semi-icons';

function SvgComponent(props: React.SVGProps<SVGSVGElement>) {
  return (
    <svg
      t="1708259036847"
      class="icon"
      viewBox="0 0 1024 1024"
      version="1.1"
      // 注意自定义icon需要加上下面参数
      width="1em"
      height="1em"
      focusable={false}
      aria-hidden={true}
      {...props}
    >
      <path
        d="M440.7 314.3c-16.5-9.5-34.1-10.3-48.4-2-14.3 8.2-22.4 23.9-22.4 42.9v308.4c0 19 8.2 34.7 22.4 42.9 6.6 3.8 13.9 5.7 21.4 5.7 8.8 0 18.1-2.6 27-7.7l267.1-154.2c16.5-9.5 26-24.4 26-40.9s-9.5-31.4-26-40.9L440.7 314.3z m-16 336.1v-282l244.2 141-244.2 141z"
        fill="#4D4D4D"
        p-id="10399"
      ></path>
      <path
        d="M924 343.8c-7.1-17.6-27-26.1-44.6-19-17.6 7.1-26.1 27-19 44.6 17.9 44.6 27 91.9 27 140.4 0 207.8-169.1 376.9-376.9 376.9-207.8 0-376.9-169.1-376.9-376.9s169.1-376.9 376.9-376.9c82.3 0 160.4 26 226 75.3 15.1 11.4 36.6 8.3 48-6.8 11.4-15.1 8.3-36.6-6.8-48-77.6-58.2-170-89-267.2-89C264.9 64.4 65 264.2 65 509.9c0 245.6 199.8 445.5 445.5 445.5 245.6 0 445.5-199.8 445.5-445.5 0-57.4-10.8-113.3-32-166.1z"
        fill="#4D4D4D"
        p-id="10400"
      ></path>
      <path
        d="M826.8 268.1m-39.6 0a39.6 39.6 0 1 0 79.2 0 39.6 39.6 0 1 0-79.2 0Z"
        fill="#4D4D4D"
        p-id="10401"
      ></path>
    </svg>
  );
}
export const IconEnable = convertIcon(SvgComponent, 'align_center_vertical');
